"""Label text collections for various UI dashboards."""


alarm_led_labels = [
    'Питание цепей управления 24В',
    'Реле безопасности А',
    'Реле безопасности В',
    'Питание цепей управления 220В',
    'Аварийный КВ (Верх)',
    'Аварийный КВ (Низ)',
    'Аварийный КВ (Дверь открыта)',
    'Все цепи безопасности собраны',
]


ups_led_labels = [
    'Блок питания',
    'Аккумулятор разряжен',
    'Работа от аккумулятора',
]


power_labels = [
    'Питание сервопривода включено',
    'Привод траверсы активирован',
]

